
# SQL Challenge <img src="img/sql.png" width = 150, height = 150, align = "right">

In [26]:
# pandas 
import pandas as pd

import matplotlib as plt
%matplotlib inline

# SQL Alchemy
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect

In [27]:
# from sql alchemy import create_engine
engine = create_engine("postgresql://postgres:postgres@localhost:5432/mydb")
connection = engine.connect()

## Pandas Objectives: <img src="img/panda.jpg" width = 160, height = 160, align = "right">
1. Import the SQL database into Pandas.
2. Create a histogram to visualize the most common salary ranges for employees.
3. Create a bar chart of average salary by title.

In [28]:
# Query All Records in the the Database/testing
data = pd.read_sql("SELECT * FROM EmployeeData.employees", connection)

In [24]:
# preview the table
data.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date
0,10001,1953-09-02,Georgi,Facello ...,M,1986-06-26
1,10002,1964-06-02,Bezalel,Simmel ...,F,1985-11-21
2,10003,1959-12-03,Parto,Bamford ...,M,1986-08-28
3,10004,1954-05-01,Chirstian,Koblick ...,M,1986-12-01
4,10005,1955-01-21,Kyoichi,Maliniak ...,M,1989-09-12